Gestion des donn√©es manquantes

In [62]:
#import pandas
import pandas as pd

In [63]:
fp = "https://bit.ly/tx-data"
print(fp)

https://bit.ly/tx-data

In [64]:
# Charge dataset

fp = "https://bit.ly/tx-data"
print(fp)
df = pd.read_csv(fp)
df.head()

https://bit.ly/tx-data

  transaction_id first_name  last_name       ip_address   amount
0      50563-403     Jacobo   Haresign    18.144.134.48  $647.77
1     54569-3911    Christy       Derl  254.107.123.242  $460.47
2     59667-0024     Florie     Prewer    148.80.11.233  $565.38
3      60429-123     Danika     Shimuk   233.91.221.158  $794.76
4      0187-0771   Annelise  Antonescu   238.143.41.105  $790.41

In [65]:
df.tail()

   transaction_id first_name   last_name      ip_address   amount
43      0456-2212     Layney    Janssens    79.49.30.228  $889.27
44      59779-276   Lynnelle     Ainslie     38.85.34.83  $473.65
45      68712-049    Phaedra     Teodoro    92.45.204.14  $445.56
46     10157-9539    Sibylla      Pedron  207.112.216.80  $362.15
47      0378-1044   Sharlene  Wolfendale  32.253.106.253  $133.98

In [66]:
df.dtypes

transaction_id    object
first_name        object
last_name         object
ip_address        object
amount            object
dtype: object

In [67]:
# Identify doubles

df[df.duplicated()]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [68]:
df[df.duplicated(subset = ['transaction_id'])]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [69]:
df.duplicated().sum() # count doubles
# On a 7

7

In [70]:
df = df.drop_duplicates(subset = ['transaction_id'])
df.shape

(41, 5)

In [71]:
df.to_csv("transactions.csv",sep=";")

In [72]:
fp = 'https://bit.ly/missing-values'
print(fp)

https://bit.ly/missing-values

In [73]:
df = pd.read_csv(fp)
df

df2 = df
df3 = df

In [74]:
df.head()

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

In [75]:
df.shape

(917, 2)

In [76]:
df.dtypes

color      object
rating    float64
dtype: object

In [77]:
#identify NAN

df.isna().sum()

#the variable "color" has 129 missing data, the "rating" 256

color     129
rating    256
dtype: int64

In [78]:
df.isna().mean() #%

#14,6%

color     0.140676
rating    0.279171
dtype: float64

In [79]:
df['color'].value_counts()

color
Blue      323
Red       234
Orange    154
Yellow     77
Name: count, dtype: int64

In [80]:
df['color'].value_counts(dropna=False)

color
Blue      323
Red       234
Orange    154
NaN       129
Yellow     77
Name: count, dtype: int64

In [81]:
#managing NAN
df2=df.dropna() #suppression des ligne contient donn√©s manquantes
df2.shape #pas envisageable car perds trop de donn√©es

(532, 2)

In [83]:
df3 = df.dropna(how = 'all')
df3.shape

(917, 2)

In [84]:
df4 = df.dropna(how = 'any' , subset = ['color'])
df4.shape

(788, 2)

In [85]:
moyenne = df['rating'].mean()
moyenne

3.0666717095310134

In [86]:
df["rating"].fillna(moyenne,inplace=True)

In [88]:
df.head()

  color    rating
0   NaN  1.160000
1   Red  3.066672
2  Blue  2.540000
3   Red  1.510000
4   Red  3.066672

In [91]:
df['color'].value_counts(dropna=False)

color
Blue      452
Red       234
Orange    154
Yellow     77
Name: count, dtype: int64

In [89]:
df["color"].fillna("Blue",inplace=True)

In [90]:
df.head()

  color    rating
0  Blue  1.160000
1   Red  3.066672
2  Blue  2.540000
3   Red  1.510000
4   Red  3.066672